Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སྲས་ནི་སྐྲག་མེད་ཅེས་བྱའོ། །
en: Fearless will be his son.

source: རིམ་གྲོ་པ་ནི་མི་སྐྲག་གནས་ཞེས་བྱའོ། །
en: Enduring Fearlessness will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Unconquerable Banner will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚོགས་ཐུབ་ཅེས་བྱའོ། །
en: Capable Gathering will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be nine consecutive congregations, each of them gathering one billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲི་དགུ་སྟོང་ངོ་། །
en: The extent of his lifespan will be nineteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་གྲོགས་བརྟན་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་གནས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Sthitamitra will be born in a place called Enduring Array.

source: འོད་ནི་དཔག་ཚད་ཉིས་སྟོང་ངོ་། །
en: His light will extend two thousand leagues.

source: ཡབ་ནི་བཀོད་པ་བྱིན་ཞེས་བྱའོ། །
en: Array Gift will be his father.

source: ཡུམ་ནི་དགའ་སྡུག་ཅེས་བྱའོ། །
en: Beautiful Joy will be his mother.

source: སྲས་ནི་བློ་མི་གཡོ་ཞེས་བྱའོ། །
en: Unmoving Mind will be his son.

source: རིམ་གྲོ་པ་ནི་སེམས་སྙོམས་ཞེས་བྱའོ། །
en: Equanimous Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེ་བར་གནས་ཞེས་བྱའོ། །
en: Delightful Abiding will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མདངས་ཀྱིས་འགྲོ་ཞེས་བྱའོ། །
en: Bright Movement will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅྭ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be fifteen consecutive congregations, each of them gathering one trillion.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བཞི་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for forty thousand years.

source: དེ་བཞིན་གཤེགས་པ་འོད་གནས་མཚུངས་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་བཅོས་པ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Prabhāsthita­kalpa will be born in a place called Uncreated Array.

source: ཡབ་ནི་བདག་ཉིད་ཐུལ་ཞེས་བྱའོ། །
en: Trained Being will be his father.

source: ཡུམ་ནི་སྡེས་མི་ཐུབ་ཅེས་བྱའོ། །
en: Uninvadable will be his mother.

source: སྲས་ནི་སྣ་ཚོགས་སྡེ་ཞེས་བྱའོ། །
en: Diverse Forces will be his son.

source: རིམ་གྲོ་པ་ནི་ཚངས་པའི་དབྱངས་ཞེས་བྱའོ། །
en: Brahmā Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མ་ཆགས་སེམས་ཞེས་བྱའོ། །
en: Detached Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤྱོད་པ་མ་བཅོས་པ་ཞེས་བྱའོ། །
en: Uncontrived Conduct will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be eleven consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་ནོར་བུའི་ཞབས་སྐྱེ་བའི་ཡུལ་ནི་ནོར་བུ་གསལ་ཞེས་བྱའོ། །
en: “The thus-gone Maṇicaraṇa will be born in a place called Luminous Jewel.

source: འོད་ནི་དཔག་ཚད་ཉི་ཤུ་རྩ་གཉིས་སོ། །
en: His light will extend twenty-two leagues.

source: ཡབ་ནི་རིན་ཆེན་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Jewel will be his father.

source: ཡུམ་ནི་རིན་ཆེན་འཕགས་པ་ཞེས་བྱའོ། །
en: Superior Jewel will be his mother.

source: སྲས་ནི་ནོར་བུའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Jewel Essence will be his son.

source: རིམ་གྲོ་པ་ནི་བྱམས་དགའ་ཞེས་བྱའོ། །
en: Joyous Love will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེམས་པ་འོད་ཅེས་བྱའོ། །
en: Radiant Attention will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་བཅུ་བདུན་ཏེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be seventeen consecutive congregations, each of them gathering ten billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ལྔ་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: The extent of his lifespan will be fifty-six thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཐར་པའི་གཟི་བརྗིད་སྐྱེ་བའི་ཡུལ་ནི་རྣམ་པར་ཐར་པ་ཞེས་བྱའོ། །
en: “The thus-gone Mokṣatejas will be born in a place called Liberation.

source: ཡབ་ནི་ཆགས་པ་མེད་པའི་སེམས་ཞེས་བྱའོ། །
en: Detached Mind will be his father.

source: ཡུམ་ནི་ཡིད་དགའ་མ་ཞེས་བྱའོ། །
en: Joyous Mind will be his mother.

source: སྲས་ནི་སེམས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Mind will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོད་སྦྱིན་ལེགས་ཞེས་བྱའོ། །
en: Excellent Sacrifice will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་དགའ་ཞེས་བྱའོ། །
en: Splendid Joy will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོད་འོས་ཅེས་བྱའོ། །
en: Worthy of Worship will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་ངོས་བཟངས་སྐྱེ་བའི་ཡུལ་ནི་ཐུབ་པ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Sundarapārśva will be born in a place called Indomitable.

source: ཡབ་ནི་མཆོད་སྦྱིན་ལེགས་མཆོད་བྱིན་ཞེས་བྱའོ། །
en: Gift of Excellent Sacrifice will be his father.

source: སྲས་ནི་ཁྱད་པར་སེམས་ཞེས་བྱའོ། །
en: Special Mind will be his son.

source: རིམ་གྲོ་པ་ནི་ལེགས་བྱིན་ཞེས་བྱའོ། །
en: Excellent Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤུགས་བརྟན་འཛིན་ཞེས་བྱའོ། །
en: Powerful Adherence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མདངས་ཐོབ་ཅེས་བྱའོ། །
en: Brightness Attained will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུའོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་བརྒྱད་དོ། །བཞི་པ་ལ་ནི་བྱེ་བ་སྟོང་ཕྲག་བཅུའོ། །
en: In the first congregation there will be nine hundred billion hearers; in the second there will be fifty billion; in the third, eighty billion; and in the fourth, one hundred billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventy-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་བློ་བཟངས་སྐྱེ་བའི་ཡུལ་ནི་སངས་རྒྱས་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Subuddhi will be born in a place called Endowed with a Buddha.

source: ཡུམ་ནི་ཡོན་ཏན་མཐའ་ཡས་མ་ཞེས་བྱའོ། །
en: Infinite Qualities will be his mother.

source: སྲས་ནི་སྐྱེ་བའི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Stūpa for Humanity will be his son.

source: རིམ་གྲོ་པ་ནི་ལྟ་བ་ཅན་ཞེས་བྱའོ། །
en: Endowed with View will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྩལ་བདག་ཅེས་བྱའོ། །
en: Dexterous Being will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་དག་པའི་ཏོག་ཅེས་བྱའོ། །
en: Crest of Purity will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་དྲུག་གོ། །
en: There will be seventy consecutive congregations, each of them gathering three hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་གཟི་བརྗིད་སྐྱེ་བའི་ཡུལ་ནི་སྒྲིབ་པ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Samantadarśin will be born in a place called Unobscured.

source: ཡབ་ནི་ས་གའི་སེམས་ཞེས་བྱའོ། །
en: Vaiśākha Mind will be his father.

source: ཡུམ་ནི་སེམས་མི་འཁྲུག་ཅེས་བྱའོ། །
en: Unperturbed Mind will be his mother.

source: སྲས་ནི་ལྷུན་པོའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Giant Banner will be his son.

source: རིམ་གྲོ་པ་ནི་སེང་གེའི་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Lion Strength will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་ཀྱིས་བལྟ་ཞེས་བྱའོ། །
en: Dharma View will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་རྩི་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Elixir will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be sixteen consecutive congregations, each of them gathering three million.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་མཆོག་སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་དམ་པ་ཞེས་བྱའོ། །
en: “The thus-gone Jñānavara will be born in a place called True Wisdom.

source: ཡབ་ནི་བློ་གྲོས་གྱ་ནོམ་ཞེས་བྱའོ། །
en: Sublime Intelligence will be his father.

source: སྲས་ནི་ཆོས་དཔལ་ཞེས་བྱའོ། །
en: Dharma Glory will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་དག་ཅེས་བྱའོ། །
en: Pure Merit will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཁྲུག་མེད་གྲགས་ཞེས་བྱའོ། །
en: Unshakable Fame will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དགུ་དགུའོ། །
en: There will be ninety consecutive congregations, each of them gathering nine hundred million.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པར་གནས་སྐྱེ་བའི་ཡུལ་ནི་བདེ་བས་མཐོང་ཞེས་བྱའོ། །
en: “The thus-gone Brahmavāsa will be born in a place called Seen through Bliss.

source: ཡབ་ནི་སེམས་གསལ་ཞེས་བྱའོ། །
en: Clear Mind will be his father.

source: ཡུམ་ནི་ཚངས་བྱིན་མ་ཞེས་བྱའོ། །
en: Brahmā Gift will be his mother.

source: རིམ་གྲོ་པ་ནི་སྒྲ་མི་ཟད་ཅེས་བྱའོ། །
en: Inexhaustible Sound will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲོགས་མཁས་ཞེས་བྱའོ། །
en: Expert Proclaimer will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་ལྔ་བཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བདུན་སྟོང་བདུན་སྟོང་ངོ་། །
en: There will be fifty-six consecutive congregations, each of them gathering seventy billion.

source: དེ་བཞིན་གཤེགས་པ་བདེན་པ་གསུང་སྐྱེ་བའི་ཡུལ་ནི་ཀུན་ཏུ་སྐར་མདའ་ཞེས་བྱའོ། །
en: “The thus-gone Satyaruta will be born in a place called Constant Shooting Stars.

source: ཡབ་ནི་སྐྱེ་བོའི་དབང་པོ་ཞེས་བྱའོ། །
en: Ruler of Humans will be his father.

source: ཡུམ་ནི་ཀུ་མུ་དའི་སོ་ཞེས་བྱའོ། །
en: Water Lily Blade will be his mother.

source: སྲས་ནི་བདེན་དཔལ་ཞེས་བྱའོ། །
en: Glory of the Truth will be his son.

source: རིམ་གྲོ་པ་ནི་དབང་པོ་བསྡམས་ཞེས་བྱའོ། །
en: Sense Control will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་ལྡན་ཞེས་བྱའོ། །
en: Powerful will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Splendor will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། །ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be fourteen consecutive congregations, each of them gathering ten billion.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དགུ་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for ninety thousand years.

source: དེ་བཞིན་གཤེགས་པ་བློ་བཟངས་སྐྱེ་བའི་ཡུལ་ནི་འོད་ཟེར་རྣམ་པར་འཕྲོ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Subuddhi will be born in a place called Radiant Light.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་སྟོང་བཞི་བརྒྱའོ། །
en: His light will extend eight thousand six hundred leagues.

source: ཡབ་ནི་བརྟུལ་ཞུགས་སེམས་ཞེས་བྱའོ། །
en: Mind of Yogic Discipline will be his father.

source: ཡུམ་ནི་སྐར་མདའ་འཆང་ཞེས་བྱའོ། །
en: Holder of Shooting Stars will be his mother.

source: སྲས་ནི་མཆོད་རྟེན་མཆོད་ཅེས་བྱའོ། །
en: Stūpa Worship will be his son.

source: རིམ་གྲོ་པ་ནི་བྱང་ཆུབ་འདོད་ཅེས་བྱའོ། །
en: Wish for Awakening will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་བརྟན་པའི་འགྲོས་ཞེས་བྱའོ། །
en: Mode of Tremendous Stability will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་རྩ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་དྲུག་གོ། །
en: There will be seventy-five consecutive congregations, each of them gathering three million six hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་སྟོབས་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་མ་སྨད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Baladatta will be born in a place called Irreproachable.

source: འོད་ནི་དཔག་ཚད་ལྔ་བཅུ་རྩ་དྲུག་གོ། །
en: His light will extend fifty-six leagues.

source: ཡབ་ནི་གཞན་གྱིས་མི་ཐུབ་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed for Invincibility will be his father.

source: རིམ་གྲོ་པ་ནི་སྐྱོན་མེད་པར་གནས་པ་ཞེས་བྱའོ། །
en: Flawless Persistence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་འཛིན་པའི་བློ་ཞེས་བྱའོ། །
en: Mind of Universal Retention will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དེས་པར་དགའ་ཞེས་བྱའོ། །
en: Decisive Joy will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་སུམ་ཅུ་རྩ་གསུམ་གསུམ་མོ། །
en: There will be seventy-two consecutive congregations, each of them gathering three million three hundred thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་གསུམ་མོ། །
en: The extent of his lifespan will be thirty million years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བྱེ་བ་ཕྲག་གསུམ་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for thirty million years.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེ་སྟབས་སྐྱེ་བའི་ཡུལ་ནི་དབྱངས་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Siṃhagati will be born in a place called Supreme Melody.

source: ཡབ་ནི་ལྷ་འདོད་ཅེས་བྱའོ། །
en: Divine Wish will be his father.

source: ཡུམ་ནི་ཕན་འགྲོ་མ་ཞེས་བྱའོ། །
en: Beneficial Movement will be his mother.

source: སྲས་ནི་ལྷ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Deity will be his son.

source: རིམ་གྲོ་པ་ནི་མྱ་ངན་སེལ་ཞེས་བྱའོ། །
en: Dispeller of Suffering will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འདམ་ལས་རྒལ་ཞེས་བྱའོ། །
en: Traverser of the Swamp will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགྲ་བཅོམ་བསྲུངས་ཞེས་བྱའོ། །
en: Protection of the Worthy Ones will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དགུའོ། །
en: There will be sixteen consecutive congregations, each of them gathering nine hundred ninety million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དགུ་ཁྲི་བཞི་སྟོང་ངོ་། །
en: The extent of his lifespan will be ninety-four thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དགུ་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for ninety-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གི་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་དྲི་ལྡན་ཞེས་བྱའོ། །
en: “The thus-gone Puṣpaketu will be born in a place called Fragrant Flower.

source: ཡབ་ནི་དབྱིག་གི་ཟླ་བ་ཞེས་བྱའོ། །
en: Splendid Moon will be his father.

source: སྲས་ནི་མེ་ཏོག་སོ་ཞེས་བྱའོ། །
en: Flower Edge will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Divine Flower will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགྲ་བཅོམ་བྱིན་ཞེས་བྱའོ། །
en: Gift of the Worthy Ones will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོན་དགའ་ཞེས་བྱའོ། །
en: Teacher of Joy will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be nine consecutive congregations, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འབྱུང་གནས་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་འབྱུང་གནས་ཞེས་བྱའོ། །
en: “The thus-gone Jñānākara will be born in a place called Source of Qualities.

source: ཡབ་ནི་ཡོན་ཏན་མཆོད་གནས་ཞེས་བྱའོ། །
en: Qualities Worthy of Worship will be his father.

source: ཡུམ་ནི་ཁ་ལོ་སྒྱུར་དགའ་ཞེས་བྱའོ། །
en: Leader Joy will be his mother.

source: སྲས་ནི་འོད་ཟེར་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Light Rays will be his son.

source: རིམ་གྲོ་པ་ནི་བཀྲ་ཤིས་འཛིན་ཞེས་བྱའོ། །
en: Possessor of Auspiciousness will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ཏོག་ཅེས་བྱའོ། །
en: Wisdom Crest will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་བྱིན་ཞེས་བྱའོ། །
en: Light Gift will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་འདོད་ཅེས་བྱའོ། །
en: “The thus-gone Puṣpadatta will be born in a place called Wish for Merit.

source: ཡུམ་ནི་ཡོན་ཏན་རིན་ཆེན་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Precious Qualities will be his mother.

source: སྲས་ནི་རྣམ་པར་ལྟ་བ་གྲགས་པ་དཔག་མེད་ཅེས་བྱའོ། །
en: View of Infinite Renown will be his son.

source: རིམ་གྲོ་པ་ནི་བརྩོན་འགྲུས་ཐོབ་ཅེས་བྱའོ། །
en: Diligence Attainer will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་ཀྱིས་དཔྱོད་ཅེས་བྱའོ། །
en: Discernment will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིགས་མེད་བློ་ཞེས་བྱའོ། །
en: Fearless Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be six consecutive congregations, each of them gathering three hundred million.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་སྙིང་པོ་སྐྱེ་བའི་ཡུལ་ནི་ལྷའི་ཕོ་ཉ་ཞེས་བྱའོ། །
en: “The thus-gone Guṇagarbha will be born in a place called Divine Messenger.

source: ཡབ་ནི་ནོར་བྱིན་ཞེས་བྱའོ། །
en: Wealth Gift will be his father.

source: ཡུམ་ནི་རིན་ཆེན་སྡོང་ཞེས་བྱའོ། །
en: Jewel Tree will be his mother.

source: སྲས་ནི་སྐྱོན་མེད་ཅེས་བྱའོ། །
en: Flawless will be his son.

source: རིམ་གྲོ་པ་ནི་ཡིད་འཐད་ཅེས་བྱའོ། །
en: Reasoning Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཏོག་མཐུ་ཞེས་བྱའོ། །
en: Crest of Power will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲན་པས་འགྲོ་ཞེས་བྱའོ། །
en: Moving with Recollection will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་བདུན་ཏེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་རེ་རེར་མཚུངས་སོ། །
en: There will be seventeen consecutive congregations of hearers, each of them gathering ten thousand.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for ten thousand years.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་གྲགས་བདག་ཅེས་བྱའོ། །
en: “The thus-gone Yaśoratna will be born in a place called Master of Fame.

source: ཡབ་ནི་དགེ་བ་དགའ་ཞེས་བྱའོ། །
en: Virtuous Joy will be his father.

source: ཡུམ་ནི་སྤྱོད་ལམ་ལྡན་མ་ཞེས་བྱའོ། །
en: Possessor of Religious Conduct will be his mother.

source: སྲས་ནི་སྣ་ཚོགས་སེམས་ཞེས་བྱའོ། །
en: Diverse Mind will be his son.

source: རིམ་གྲོ་པ་ནི་རིག་གསུམ་ལྡན་ཞེས་བྱའོ། །
en: Possessor of Threefold Knowledge will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིག་སྔགས་འཆང་ཞེས་བྱའོ། །
en: Holder of Knowledge Mantras will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྨན་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Doctor will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་དྲུག་ཅུ་རྩ་རེ་རེའོ། །
en: There will be twenty-nine consecutive congregations of worthy ones, each of them gathering six hundred million.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པ་རྨད་དུ་བྱུང་བ་སྐྱེ་བའི་ཡུལ་ནི་ལྷའི་ཕོ་ཉ་ཞེས་བྱའོ། །
en: “The thus-gone Adbhutayaśas will be born in a place called Divine Messenger.

source: སྲས་ནི་བསོད་ནམས་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Merit will be his son.

source: རིམ་གྲོ་པ་ནི་བསོད་ནམས་མི་དམན་པ་ཞེས་བྱའོ། །
en: No Merit Deficiency will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Dharma Banner will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་སྟབས་ལྟར་འགྲོ་ཞེས་བྱའོ། །
en: Moving with the Gait of a Lion will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་རེ་རེའོ། །
en: There will be fourteen consecutive congregations, each of them gathering ten thousand.

source: དེ་བཞིན་གཤེགས་པ་མི་ཚུགས་པ་སྐྱེ་བའི་ཡུལ་ནི་བལྟ་ན་སྡུག་ཅེས་བྱའོ། །
en: “The thus-gone Anihata will be born in a place called Beautiful to See.

source: འོད་ནི་དཔག་ཚད་ལྔ་བཅུ་རྩ་ལྔའོ། །
en: His light will extend fifty-five leagues.

source: ཡབ་ནི་འོད་གསལ་ཞེས་བྱའོ། །
en: Luminosity will be his father.

source: ཡུམ་ནི་སྣང་བ་མཐའ་ཡས་མ་ཞེས་བྱའོ། །
en: Infinite Light will be his mother.

source: སྲས་ནི་སྤོབས་པའི་བློ་ཞེས་བྱའོ། །
en: Mind of Acumen will be his son.

source: རིམ་གྲོ་པ་ནི་ཐོས་པའི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Learning will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤོབས་པའི་ལྷ་ཞེས་བྱའོ། །
en: God of Eloquence will be foremost in terms of insight.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་དགུའོ། །
en: There will be six consecutive congregations of hearers, each of them gathering ninety million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲི་སུམ་སྟོང་ངོ་། །
en: The extent of his lifespan will be thirteen thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for six thousand years.

source: དེ་བཞིན་གཤེགས་པ་བསྙེངས་མེད་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་སྐྱེ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Abhaya will be born in a place called Manifestation of Splendor.

source: འོད་ནི་དཔག་ཚད་ཉི་ཤུ་རྩ་བདུན་ནོ། །
en: His light will extend twenty-seven thousand leagues.

source: ཡབ་ནི་ཡུལ་འཁོར་ལྷ་ཞེས་བྱའོ། །
en: God of the Land will be his father.

source: ཡུམ་ནི་ཚངས་དབྱངས་མ་ཞེས་བྱའོ། །
en: Brahmā Melody will be his mother.

source: སྲས་ནི་དབྱངས་མཁས་ཞེས་བྱའོ། །
en: Expert Melody will be his son.

source: རིམ་གྲོ་པ་ནི་རྒོལ་བས་མཆོད་ཅེས་བྱའོ། །
en: Revered by Opponents will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐར་མདའ་འཆང་ཞེས་བྱའོ། །
en: Holder of Shooting Stars will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཞལ་མེད་མཆོག་ཅེས་བྱའོ། །
en: Supreme Immeasurability will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be thirty consecutive congregations of hearers, each of them gathering twenty-two billion.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Sūryaprabha will be born in a place called Splendid Merit.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་ཁྲིའོ། །
en: His light will extend eighty thousand leagues.

source: ཡབ་ནི་བདེན་པ་བྱིན་ཞེས་བྱའོ། །
en: Truth Gift will be his father.

source: སྲས་ནི་སྐྱེ་བའི་དབང་པོས་བྱིན་ཞེས་བྱའོ། །
en: Gift of the Master of Birth will be his son.

source: རིམ་གྲོ་པ་ནི་དྲི་ཟའི་བློ་ཞེས་བྱའོ། །
en: Gandharva Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐོས་པའི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Learning will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་ཆོས་ཞེས་བྱའོ། །
en: Divine Dharma will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་བདུན་ཅུ་བདུན་ཅུའོ། །
en: There will be one hundred consecutive congregations of hearers, each of them gathering seventy billion.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲི་དགུ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for nineteen thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པར་གཤེགས་སྐྱེ་བའི་ཡུལ་ནི་སྙན་པ་མ་སྨད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Brahmagāmin will be born in a place called Unblemished Fame.

source: ཡབ་ནི་མཐུ་ལྡན་ཞེས་བྱའོ། །
en: Powerful will be his father.

source: ཡུམ་ནི་ང་རྒྱལ་དང་རྒྱགས་པ་ལས་རྣམ་པར་གྲོལ་བ་ཞེས་བྱའོ། །
en: Free from Pride and Infatuation will be his mother.

source: སྲས་ནི་མཚན་གྱིས་རྣམ་པར་སྤྲས་པ་ཞེས་བྱའོ། །
en: Adorned with Marks will be his son.

source: རིམ་གྲོ་པ་ནི་ཡིད་མི་སྐྱོ་ཞེས་བྱའོ། །
en: Untiring Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཁས་པའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Expert Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚངས་པའི་སྒྲ་དབྱངས་ཞེས་བྱའོ། །
en: Brahmā Melody will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅྭ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་རེ་རེའོ། །
en: There will be fifteen consecutive congregations of hearers, each of them gathering ten thousand.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཉི་ཁྲི་བདུན་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty-seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལྷའི་མཐུ་རྩལ་སྐྱེ་བའི་ཡུལ་ནི་མངོན་དུ་འགྲོ་བར་བྱ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Vikrāntadeva will be born in a place called Approach.

source: ཡབ་ནི་ཐམས་ཅད་བྱིན་ཞེས་བྱའོ། །
en: Giver of All will be his father.

source: སྲས་ནི་ཐམས་ཅད་འདོད་ཅེས་བྱའོ། །
en: Wish for All will be his son.

source: རིམ་གྲོ་པ་ནི་མངོན་པར་གྲགས་ཞེས་བྱའོ། །
en: Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Splendor will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲི་མ་མེད་པའི་སྙིང་པོ་ཞེས་བྱའོ། །
en: Stainless Essence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བརྒྱ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ལྔ་ལྔའོ། །
en: There will be one hundred consecutive congregations of hearers, each of them gathering fifty million.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དགྱེས་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་དད་ཅེས་བྱའོ། །
en: “The thus-gone Jñānapriya will be born in a place called Delightful Faith.

source: ཡབ་ནི་འཕགས་པ་དད་ཅེས་བྱའོ། །
en: Superior Faith will be his father.

source: ཡུམ་ནི་ལྷས་མཆོད་མ་ཞེས་བྱའོ། །
en: Worshiped by Gods will be his mother.

source: སྲས་ནི་མཆོད་འོས་ཞེས་བྱའོ། །
en: Light of Worship will be his son.
